Revit 2024 API
ExportLayerInfo.ColorNumber Property
 The color number stored in value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int ColorNumber { get; set; }
Visual Basic
Public Property ColorNumber As Integer
	Get
	Set
Visual C++
public:
property int ColorNumber {
	int get ();
	void set (int value);
}
See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace